--[[ 
▀▄ ▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀▄▀▄▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀ 
▀▄ ▄▀                                     ▀▄ ▄▀ 
▀▄ ▄▀    BY tetoo                         ▀▄ ▄▀ 
▀▄ ▄▀     BY nmore       (@l_l_lo)        ▀▄ ▄▀ 
▀▄ ▄▀ JUST WRITED BY l_l_ll               ▀▄ ▄▀ 
▀▄ ▄▀       broadcast  : help ar          ▀▄ ▄▀ 
▀▄▀▀▄▄▀▀▄▄▀▄▄▀▀▄▄▀▀▄▄▀▄▄▀▀▄▄▀▀▄▄▀▄▄▀▀▄▄▀▀▄▄▀▄▄▀▀ 
--]]

do
function run(msg, matches)
 if matches[1] == "م1" and is_momod(msg) then
    return "🎀🎖اهـلا بـك عـزيـزي 😻   "..msg.from.first_name.."\n"
  .."  ".."\n"
  ..[[
🎓اوامرالـرئـسـية😻فـي المجمـوعه🎓  

🎀🎖معلـوماتـي 😻 عـرض معـلومات العـضو

🎀🎖معـلومات 😻 لعـرض معلـومات الكروب

🎀🎖الاعـدادات 😻لعـرض اعـدادات فـي الكروب

🎀🎖 موقعي 😻 لـعرض موقعك في الكروب

🎀🎖 /ايدي 😻 لـعرض ايدك و موقعك

🎀🎖 الاعـضـاء 😻 لـعـرض اعظاء الكـروب

🎀🎖 شـنو اني  😻 لمعرفه موقعك 

🎀🎖الـقوانين 😻 لـعرض قوانيـن الكـروب

🎀🎖 الـرابـط 😻 لجـلب رابـط الـكروب

🎀🎖المــطور 😻لمعرفه مبـرمج البـوت

🎀🎖الاصـدار 😻لمعرفـة اصـدار السـورس

🤖مــطور السـورس 😻 ابـو عسـولةة
🤖 @l_l_lo
🤖قــناه الســورس
🤖 @no_no2
🤖بـوت المحـظوريـن
🤖 @k4k33_bot


]]
------------------

  elseif matches[1] == "م2" and is_momod(msg) then
    return "🎀🎖اهـلا بـك عـزيـزي 😻  "..msg.from.first_name.."\n"
  .."  ".."\n"
  ..[[
  🎓اوامــر الحـظر و الــطرد🎓

🎀🎖تســتخدم معهـا الـرد او المعـرف او ايدي

🎀🎖حـظر 😻لحظر العـظو من الكروب 

🎀🎖حظر عام😻حظر من جميع كروبات

🎀🎖الغاء العام 😻للغاء حظر عنه

🎀🎖طـرد 😻لـطرد العـظو من لكروب

🎀🎖طرد المحذوف 😻لطرد من حاذف حسابه 

🎀🎖كتـم 😻لكتم العـظو او لغاء كتم

🤖مـطور السـورس😻 ابو عســوله

🤖 @l_l_lo
🤖قــناه الســورس
🤖 @no_no2
🤖بـوت تـواصل المحظورين
🤖 @k4k33_bot

  ]]

------------------


  elseif  matches[1] == "م3" and is_momod(msg) then 
    return "🎀🎖اهـلا بـك عـزيـزي 😻   "..msg.from.first_name.."\n"
  .."  ".."\n"
  ..[[ 
   🎓اوامــر الـترقية😻فـي المجموعه 🎓

🎀🎖تسـتخدم مع المـعرف و ايدي و الـرد

🎀🎖رفع ادمـن 😻 لـرفع العـظو ادمن

🎀🎖رفع اداري 😻 لـترقيه الي اداري 

🎀🎖رفع المـدير 😻لترقيه الـي مدير مجموعه

🎀🎖تنـزيل ادمـن 😻لحـذف من اداره لبوت 

🎀🎖الاداريـن 😻 لعرض ادارين الكروب

🎀🎖الادمنيه 😻لعـرض ادمنيه

🎀🎖الاعظاء 😻لمعرفه الاعظاء

🤖مــطور السـورس 😻 ابـو عسـولةة
🤖 @l_l_lo
🤖قــناه الســورس
🤖 @no_no2
🤖بـوت المحـظوريـن
🤖 @k4k33_bot

]]
------------

  elseif  matches[1] == "م4" and is_momod(msg) then 
    return "🎀🎖اهـلا بـك عـزيـزي 😻 "..msg.from.first_name.."\n"
  .."  ".."\n"
  ..[[
  
🎓اوامـر خـاصـة😻 فـي  المجمـوعة🎓

🎀🎖ضـع صـوره
🎀🎖ضـع اسـم
🎀🎖ضـع الـرابط
🎀🎖ضـع المعـرف 
🎀🎖ضـع القـوانيـن 🏅مـع القـوانين 
🎀🎖ضـع الـوصف 🏅مـع وصـف جـديد 
🎀🎖معـلومات المجموعه
🎀🎖اعدادات الوسـائط

🤖مـطور السـورس
🤖 @l_l_lo
🤖قـناه السـورس
🤖 @no_no2
🤖بـوت تـواصـل
🤖 @k4k33_bot

]]
------------------

  elseif  matches[1] == "م5" and is_momod(msg) then 
    return "🎀🎖اهـلا بـك عـزيـزي 😻 "..msg.from.first_name.."\n"
  .."  ".."\n"
  ..[[
🎓اومــــر الحـمايـة😻في المجمـوعه🎓

🎀🎖للقفـل ☚ قـفـل + الامـر  | 🔖|
🎀🎖للفـتح ☚ فتح + الامـر.   |🔖|

🎀🎖الـصـوت 
🎀🎖الصـور
🎀🎖الفيديو 
🎀🎖الملـصقات 
🎀🎖الروابط 
🎀🎖التكرار 
🎀🎖الاضافه 
🎀🎖العربيه
🎀🎖دخول برابط
🎀🎖الاشعارات
🎀🎖التاك 
🎀🎖جهات الاتصال
🎀🎖العربيه 
🎀🎖اعادة توجية
🎀🎖الكلايش 
🎀🎖التكرار
🎀🎖اعاده توجيـه
🎀🎖منع +كلمه للمنع كلمه
🎀🎖الغاء المنع +كلمه لغاء منع

🤖مـطور السـورس 😻ابو عسـوله
🤖 https://telegram.me/l_l_lo
🤖بـوت تواصـل
🤖 @k4k33_bot
🤖قـناه السـورس 
🤖 @no_no2

]]
------------------------

 elseif  matches[1] == "م المطور" and is_momod(msg) then 
    return "🎀🎖اهـلا بـك عـزيـزي 😻   "..msg.from.first_name.."\n"
  .."  ".."\n"
  ..[[
🎓اوامـᎿℌєـر المـⅆỔـطـᵿ₷ـور🎓

🎀🎖 تفعيل 😻 للتـفعيل البـوت 

🎀🎖 تعـطيل😻 لتعـطيل الـبوت

🎀🎖 غادر 😻 لـمغـادره البوت  

🎀🎖 اضف مطور 😻  مع ايدي

🎀🎖حـذف مـطـور 😻 مع ايدي

🎀🎖 الملفات  😻 لعرض ملفات السـورس 

🎀🎖 تفعيل ملف 😻 لتفعيل ملف +اسم 

🎀🎖تعطيل ملف 😻 لتعطيل ملف +اسـم 

🎀🎖اذاعه 😻 للبـث في كروبات

🎀🎖 تفعيل لمده 😻 للتفعيل لبوت لمده زمنيه 

🎀🎖 الردود😻 لعرض الردود 

🎀🎖رد اضف 😻 لاضافه رد 

🎀🎖 رد حذف 😻 لحـذف رد 

🎀🎖 تنـظيف بلعدد 😻 لمسـح رسائل الكـروب

🤖مــطور السـورس 😻 ابـو عسـولةة
🤖 @l_l_lo
🤖قــناه الســورس
🤖 @no_no2
🤖بـوت المحـظوريـن
🤖 @k4k33_bot


]]
-----------------------

 elseif  matches[1] == "الاوامر" and is_sudo(msg) then 
    return "🎀🎖اهـلا بـك عـزيـزي 😻  "..msg.from.first_name.."\n"
  .."  ".."\n"
  ..[[
  🎓هـنالك سـتةة قـوائم الاوامـر🎓

🎀🎖سـورس تيـتو @no_no2

🎀🎖م1 😻لـعرض اوامـر الـرئـسيةة

🎀🎖 م2😻 لـعـرض الاومـر الـطـرد و لحـظر

🎀🎖 م3 😻 لـعـرض الاومـر التـرقيـةة 

🎀🎖م4 😻لـعـرض الاومـر المجموعـةة

🎀🎖م5 😻لعـرض اومـر الحـماية

🎀🎖م المـطور  😻 لعـرض اومـر المـطور


🤖مــطور السـورس 😻 ابـو عسـولةة
🤖 @l_l_lo
🤖قــناه الســورس
🤖 @no_no2
🤖بـوت المحـظوريـن
🤖 @k4k33_bot

  ]]
  end
end
return {
  patterns = {
    "^(م1)",
    "^(م2)",
    "^(م3)",
    "^(م4)",
    "^(م5)",
    "^(م المطور)",
    "^(الاوامر)",
    
  },
  run = run
}
end

---by tetoo
-- @l_l_lo
